tutorials/case327-dcmd-speciesFluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case327-dcmd-speciesFluid
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Three-region DCMD with solved incompressible flow AND latent heat coupling.
//
// Extends case326 (prescribed plug flow + latent heat) by replacing speciesSolid
// with speciesFluid for the feed and permeate channels.  speciesFluid inherits
// the PIMPLE velocity-pressure loop from incompressibleFluid (OF-13) and adds
// the temperature and species transport equations.
//
// Expected physics vs case326:
//   - Hydrodynamic boundary layer develops from inlet → Poiseuille-like profile.
//   - Thermal BL and velocity BL evolve independently — Graetz-type entrance
//     effects appear naturally without any Pe-based upwind correction.
//   - Latent heat (J·L_vap·M) still cools T_mf and warms T_mp.
//   - Eliminated numerical diffusion: no upwind scheme for thermal advection.

application     foamMultiRun;

regionSolvers
{
    feed        speciesFluid;
    membrane    speciesSolid;
    permeate    speciesFluid;
}

libs
(
    "libspeciesTransport.so"
    "libspeciesCoupling.so"
    "libspeciesSolid.so"
    "libspeciesFluid.so"
);

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         10.0;

deltaT          0.001;

writeControl    runTime;
writeInterval   2;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

// ************************************************************************* //
