tutorials/case327-dcmd-speciesFluid/system/feed/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case327-dcmd-speciesFluid / feed
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Feed channel: hot salt water at 333 K, plug-flow inlet at 0.215 m/s in +y.
// speciesFluid solves T directly (not e), so div(phi,T) replaces div(rhoPhi,e).
//
// div(phi,U): linearUpwind — bounded second-order for momentum.
// div(phi,T): linearUpwind — eliminates Pe=892 axial smearing; the velocity
//   field is now solved so there is no frozen-U approximation to worry about.
// div(phi,C_H2O): upwind mandatory — species Pe is astronomical.

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default     Gauss linear;
}

divSchemes
{
    default             none;
    div(phi,U)          Gauss linearUpwind grad(U);
    div(phi,T)          Gauss linearUpwind grad(T);
    div(phi,C_H2O)      Gauss upwind;
}

laplacianSchemes
{
    default     Gauss linear corrected;
}

interpolationSchemes
{
    default     linear;
}

snGradSchemes
{
    default     corrected;
}

// ************************************************************************* //
