tutorials/case327-dcmd-speciesFluid/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

runApplication blockMesh
runApplication splitMeshRegions -cellZones -overwrite
runApplication foamMultiRun
